:PROPERTIES:
:ID:       feaabe2a-b4da-4ff6-a8ec-c2eabb5ccc93
:END:
#+TITLE: Shipping a Python service to production
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :results verbatim :cache yes

I have a Python service that passed all its tests and I want to ship
it. The build needs compilers and dev headers to install native
dependencies, but in production I want the smallest possible image —
no shell, no package manager, nothing an attacker could use. This is
the classic multi-stage build: build in Debian, run in distroless.

First I set up my Dagger project and install daggerlib:

#+begin_src bash :eval no-export
dagger init --sdk=python
dagger install github.com/Konubinix/daggerlib
#+end_src

#+RESULTS[d6944fcc24dccaf5a3a2e78ed0ae4a9b5d09d40f]:

The following is only for testing purposes — it makes the project
use the local daggerlib checkout instead of the published version:

#+begin_src bash :eval no-export
sed -i '/pin/d; s|"github.com/Konubinix/daggerlib@main"|"../.."|; s|"\.\./\.\.",|"../.."|' dagger.json
#+end_src

#+RESULTS[5b6339ed6b209c2bc103c0b4e60ac9dd71b8e70a]:

Here is my service — it logs a startup message with timezone info:

#+begin_src python :tangle service.py
"""Minimal service that logs a startup message with timezone info."""
from datetime import datetime

tz = datetime.now().astimezone().tzname()
print(f"service started (timezone: {tz})")
#+end_src

Then I write my Dagger module. The =<<run-distroless>>= reference is
defined further below:

#+begin_src python :tangle .dagger/src/production_images/main.py :noweb yes
from typing import Annotated

import dagger
from dagger import DefaultPath, dag, function, object_type


@object_type
class ProductionImages:
    <<run-distroless>>
#+end_src

* Preparing timezone data for the production image

  Distroless images have no =apt= or =apk= to install timezone data.
  The daggerlib =alpine-tz= helper extracts the timezone files from
  Alpine so they can be injected into distroless images — this is
  what =distroless-python-3-debian= does internally. Here I verify
  the extraction produces the expected files:

  #+NAME: tz_artifacts
  #+begin_src fixtureyaml
func: alpine-tz
chain:
  - export: $TMP/out
post: ls "$TMP/out" | sort
  #+end_src

#+RESULTS: tz_artifacts
:results:
#+NAME: tz_artifacts-run
#+begin_src bash :exports code :eval no-export
dagger call alpine-tz export --path="$TMP/out" > /dev/null
ls "$TMP/out" | sort
#+end_src

#+RESULTS[501fd8e2b72c5b4334e89b88212de0d39472e2e0]: tz_artifacts-run
: bin
: include
: lib
: lib64
: localtime
: pyvenv.cfg
: timezone

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/tz_artifacts" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<tz_artifacts-run()>>
#+END_SRC
:end:

* Running the service in distroless

  For my Python service, I use the distroless Python image. It ships
  only the Python interpreter — no pip, no shell, no debugging tools.
  I inject my service and run it:

  #+NAME: distroless_service
  #+begin_src fixtureyaml :eval no-export
userfunction: run-distroless
project: examples/production_images
func: distroless-python-3-debian
chain:
  - with-file:
      path: /app/service.py
      source: "${ROOT}/examples/production_images/service.py"
  - with-exec: [python3, /app/service.py]
  - stdout
  #+end_src

#+RESULTS: distroless_service
:results:
#+NAME: run-distroless
#+begin_src python
@function
async def run_distroless(self, src: Annotated[dagger.Directory, DefaultPath(".")]) -> str:
    """Generated from test spec."""
    return await (
        dag.lib().distroless_python3_debian()
        .with_file('/app/service.py', src.file('service.py'))
        .with_exec(['python3', '/app/service.py'])
        .stdout()
    )
#+end_src

#+NAME: distroless_service-run
#+begin_src bash
dagger call run-distroless
#+end_src

#+RESULTS[66de26b3c1fcc3cc120c2b55490f67d9dc4c8d65]: distroless_service-run
: service started (timezone: CEST)

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/distroless_service" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<distroless_service-run()>>
#+END_SRC
:end:
* The static variant for compiled services

  A teammate rewrote one of our services in Go. For compiled binaries,
  I use the distroless static image — even smaller than the Python
  variant, it contains no runtime at all. I verify that the timezone
  file is present so timestamps will be correct:

  #+NAME: distroless_static
  #+begin_src fixtureyaml
func: distroless-debian
chain:
  - file: /etc/localtime
  - export: $TMP/out2/localtime
post: test -s "$TMP/out2/localtime" && echo "non-empty"
  #+end_src

#+RESULTS: distroless_static
:results:
#+NAME: distroless_static-run
#+begin_src bash :exports code :eval no-export
dagger call distroless-debian file --path="/etc/localtime" export --path="$TMP/out2/localtime" > /dev/null
test -s "$TMP/out2/localtime" && echo "non-empty"
#+end_src

#+RESULTS[22bf43eaa61b484a5dd48c990ec5d3aa935b11a3]: distroless_static-run

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/distroless_static" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<distroless_static-run()>>
#+END_SRC
:end:
